[{"id": 2, "title": "Roasted Asparagus", "description": "Preheat oven to 425°F. Cut off the woody bottom part of the asparagus spears and discard. With a vegetable peeler, peel off the skin on the bottom 2-3 inches of the spears. Place asparagus on foil-lined baking sheet and drizzle with olive oil. Sprinkle with salt. With your hands, roll the asparagus around until they are evenly coated with oil and salt. Roast for 10-15 minutes, depending on the thickness of your stalks and how tender you like them. They should be tender when pierced with the tip of a knife. The tips of the spears will get very brown but watch them to prevent burning. They are great plain, but sometimes I serve them with a light vinaigrette if we need something acidic to balance out our meal.", "image": "http://img.sndimg.com/food/image/upload/w_266/v1/img/recipes/50/84/7/picMcSyVd.jpg", "ingredients": " asparagus, olive oil, kosher salt", "favourite": true, "created_at": "2017-03-22T16:49:30", "updated_at": "2019-09-12T14:05:10", "notebook_id": 3}, {"id": 4, "title": "Big Night Pizza", "description": "Add hot water to yeast in a large bowl and let sit for 15 minutes. Mix in oil, sugar, salt, and flour and let sit for 1 hour. Knead the dough and spread onto a pan. Spread pizza sauce and sprinkle cheese. Add any optional toppings as you wish. Bake at 400 deg Fahrenheit for 15 minutes. Enjoy!", "image": "http://upload.wikimedia.org/wikipedia/commons/c/c7/Spinach_pizza.jpg", "ingredients": "yeast, flour, vegetable oil, sugar, salt, hot water, pizza sauce, mozzarella cheese", "favourite": true, "created_at": "2017-03-22T16:49:30", "updated_at": "2017-03-22T16:49:30", "notebook_id": 2}, {"id": 5, "title": "Cranberry and Apple Stuffed Acorn Squash Recipe", "description": "Cut squash in half, remove seeds. Place squash in baking dish, cut-side down. Pour 1/4-inch water into dish. Bake for 30 minutes at 350 degrees F. In large bowl, combine remaining ingredients. Remove squash from oven, fill with mix. Bake for 30-40 more minutes, until squash tender. Enjoy!", "image": "http://elanaspantry.com/wp-content/uploads/2008/10/acorn_squash_with_cranberry.jpg", "ingredients": "acorn squash, boiling water, apples chopped into 1.4 inch pieces, dried cranberries, cinnamon, melted butter", "favourite": false, "created_at": "2017-03-22T16:49:30", "updated_at": "2017-03-22T16:49:30", "notebook_id": 1}, {"id": 7, "title": "Old-Fashioned Oatmeal Cookies", "description": "Simmer raisins and water over medium heat until raisins are plump, about 15 minutes. Drain raisins, reserving the liquid. Add enough water to reserved liquid to measure 1/2 cup. Heat oven to 400°. Mix thoroughly shortening, sugar, eggs and vanilla. Stir in reserved liquid. Blend in remaining ingredients. Drop dough by rounded teaspoonfuls about 2 inches apart onto ungreased baking sheet. Bake 8 to 10 minutes or until light brown. About 6 1/2 dozen cookies.", "image": "http://s3.amazonaws.com/gmi-digital-library/65caecf7-a8f7-4a09-8513-2659cf92871e.jpg", "ingredients": "raisins, cup water, shortening, sugar, flour, soda, salt, cinnamon, baking powder, cloves, oats, chopped nuts", "favourite": false, "created_at": "2017-03-22T16:49:30", "updated_at": "2017-03-22T16:49:30", "notebook_id": 1}, {"id": 8, "title": "Blueberry Oatmeal Squares", "description": "Filling: In saucepan, bring blueberries, sugar and orange juice to boil; reduce heat and simmer until tender, about 10 minutes. Whisk cornstarch with 2 tbsp (25 mL) water; whisk into blueberries and boil, stirring, until thickened, about 1 minute. Place plastic wrap directly on surface; refrigerate until cooled, about 1 hour. In large bowl, whisk together oats, flour, sugar, orange rind and salt ; with pastry blender, cut in butter until in coarse crumbs. Press half into 8-inch (2 L) square parchment paper–lined metal cake pan; spread with blueberry filling. Bake in centre of 350°F oven until light golden, about 45 minutes. Let cool on rack before cutting into squares. (Make-ahead: Cover and refrigerate for up to 2 days or overwrap with heavy-duty foil and freeze for up to 2 weeks.)", "image": "http://www.canadianliving.com/img/photos/biz/blueberry-oatmeal-squares5801359401371.jpg", "ingredients": "rolled oats, (not instant), all-purpose flour, grated orange rind, salt, cold butter, cubed, packed brown sugar, fresh blueberries, granulated sugar, orange juice, cornstarch", "favourite": false, "created_at": "2017-03-22T16:49:30", "updated_at": "2017-03-22T16:49:30", "notebook_id": 3}, {"id": 9, "title": "Curried chicken salad", "description": "ARRANGE chicken in a single layer in a large pot. Add water to just cover. Bring to a boil over medium-high. Flip chicken, reduce heat to medium and simmer until cooked, about 6 more min. Cool. STIR mayo with lemon zest, juice, curry and salt in large bowl. Using 2 forks, shred chicken, then stir into mayo mixture with mango, cranberries, green onions and celery. Divide among muffins with lettuce leaves Sandwich with tops", "image": "http://www.chatelaine.com/wp-content/uploads/2013/05/Curried-chicken-salad.jpg", "ingredients": "skinless, boneless chicken breasts, halved lengthwise, mayonnaise, lemon zest, lemon juice, curry powder, salt, ripe mangoes, diced, dried cranberries, green onions, thinly sliced, celery stalk, finely chopped, Boston lettuce, English muffins, toasted", "favourite": false, "created_at": "2017-03-22T16:49:30", "updated_at": "2017-03-22T16:49:30", "notebook_id": 1}, {"id": 3, "title": "Curried Lentils and Rice!!!", "description": "Bring broth to a low boil. Add curry powder and salt. Cook lentils for 20 minutes. Add rice and simmer for 20 minutes. Enjoy!", "image": "http://dagzhsfg97k4.cloudfront.net/wp-content/uploads/2012/05/lentils3.jpg", "ingredients": "beef broth, dried green lentils, basmati rice, curry powder, salt", "favourite": true, "created_at": "2017-03-22T16:49:30", "updated_at": "2017-03-23T15:53:58", "notebook_id": 1}, {"id": 1, "title": "Crock Pot Roast", "description": "Place beef roast in crock pot. Mix the dried mixes together in a bowl and sprinkle over the roast. Pour the water around the roast. Cook on low for 7-9 hours.", "image": "http://img.sndimg.com/food/image/upload/w_266/v1/img/recipes/27/20/8/picVfzLZo.jpg", "ingredients": " beef roast, brown gravy mix, dried Italian salad dressing mix, dry ranch dressing mix, water", "favourite": false, "created_at": "2017-03-22T16:49:30", "updated_at": "2017-03-23T14:50:45", "notebook_id": 3}, {"id": 6, "title": "Mic's Yorkshire Puds", "description": "Put the flour and some seasoning into a large bowl. Stir in eggs, one at a time. Whisk in milk until you have a smooth batter. Chill in the fridge for at least 30 minutes. Heat oven to 220C/gas mark 7. Pour the oil into the holes of a 8-hole muffin tin. Heat tin in the oven for 5 minutes. Ladle the batter mix into the tin. Bake for 30 minutes until well browned and risen.", "image": "http://upload.wikimedia.org/wikipedia/commons/f/f9/Yorkshire_Pudding.jpg", "ingredients": "plain flour, eggs, milk, olive oil", "favourite": true, "created_at": "2017-03-22T16:49:30", "updated_at": "2017-03-23T15:30:11", "notebook_id": 3}]